export const leaderboardData = [
  {
    sr: 1,
    name: "شہزاد شیر گڑھ",
    startTime: "06:00:00",
    pigeons: ["17:21:00", "17:54:00", "18:11:00", "18:12:00", "19:48:00", "20:02:00", ""],
    total: "75:28:0"
  },
  {
    sr: 2,
    name: "عدنان ڈھلوں",
    startTime: "06:00:00",
    pigeons: ["11:49:00", "14:06:00", "17:32:00", "17:43:00", "17:58:00", "18:06:00", "18:12:00"],
    total: "73:26:0"
  },
  {
    sr: 3,
    name: "چوہدری غلام ربانی مزار پور",
    startTime: "06:00:00",
    pigeons: ["12:00:00", "15:09:00", "15:19:00", "16:42:00", "16:42:00", "17:58:00", "18:11:00"],
    total: "70:1:0"
  },
  {
    sr: 4,
    name: "چوہدری شہزاد ڈوگر",
    startTime: "06:00:00",
    pigeons: ["16:54:00", "17:16:00", "18:21:00", "18:22:00", "18:35:00", "", ""],
    total: "59:28:0"
  },
  {
    sr: 5,
    name: "چوہدری خرم شاہد ڈونیاں",
    startTime: "06:00:00",
    pigeons: ["10:53:00", "14:10:00", "15:25:00", "16:02:00", "17:43:00", "17:43:00", ""],
    total: "55:56:0"
  },
  {
    sr: 6,
    name: "ضیغم شاہ اینڈ وحید بھانبڑه",
    startTime: "06:00:00",
    pigeons: ["13:40:00", "13:47:00", "17:31:00", "19:09:00", "20:06:00", "", ""],
    total: "54:13:0"
  },
  {
    sr: 7,
    name: "چوہدری مختار نمبردار بھونیاں",
    startTime: "06:00:00",
    pigeons: ["11:02:00", "17:29:00", "17:29:00", "18:15:00", "19:38:00", "", ""],
    total: "53:53:0"
  },
  {
    sr: 8,
    name: "استاد طاہر جٹ چھت ڈیرہ ڈونیاں",
    startTime: "06:00:00",
    pigeons: ["12:57:00", "15:53:00", "16:27:00", "16:44:00", "17:19:00", "", ""],
    total: "49:20:0"
  },
  {
    sr: 9,
    name: "یاران نال بہاراں بہوچھ",
    startTime: "06:00:00",
    pigeons: ["12:27:00", "14:44:00", "15:21:00", "18:11:00", "18:12:00", "", ""],
    total: "48:55:0"
  },
  {
    sr: 10,
    name: "ملک بابر ڈونیاں",
    startTime: "06:00:00",
    pigeons: ["13:29:00", "14:26:00", "16:03:00", "16:10:00", "18:24:00", "", ""],
    total: "48:32:0"
  },
  {
    sr: 11,
    name: "چوہدری شہباز کجر مالوال",
    startTime: "06:00:00",
    pigeons: ["11:17:00", "11:55:00", "14:48:00", "14:56:00", "14:59:00", "16:31:00", ""],
    total: "48:26:0"
  },
  {
    sr: 12,
    name: "عمر جٹ ساکھ",
    startTime: "06:00:00",
    pigeons: ["09:12:00", "11:29:00", "12:14:00", "12:14:00", "14:56:00", "18:13:00", ""],
    total: "42:18:0"
  },
  {
    sr: 13,
    name: "چوہدری تیمور کجر بھرج",
    startTime: "06:00:00",
    pigeons: ["11:50:00", "17:03:00", "18:27:00", "18:27:00", "", "", ""],
    total: "41:47:0"
  },
  {
    sr: 14,
    name: "وسیم ڈھونڈا شریف",
    startTime: "06:00:00",
    pigeons: ["11:15:00", "12:36:00", "18:02:00", "18:22:00", "", "", ""],
    total: "36:15:0"
  },
  {
    sr: 15,
    name: "چوہدری سمیع اللہ بھونیاں",
    startTime: "06:00:00",
    pigeons: ["10:42:00", "11:10:00", "11:21:00", "12:42:00", "17:47:00", "", ""],
    total: "33:42:0"
  },
  {
    sr: 16,
    name: "مظہر شاہ ڈھونڈا شریف",
    startTime: "06:00:00",
    pigeons: ["11:49:00", "16:33:00", "18:15:00", "", "", "", ""],
    total: "28:37:0"
  },
  {
    sr: 17,
    name: "چوہدری عدنان ڈوگر",
    startTime: "06:00:00",
    pigeons: ["11:14:00", "11:44:00", "14:31:00", "14:59:00", "", "", ""],
    total: "28:28:0"
  },
  {
    sr: 18,
    name: "چوہدری شہباز کجر مل",
    startTime: "06:00:00",
    pigeons: ["11:14:00", "12:26:00", "13:35:00", "14:33:00", "", "", ""],
    total: "27:48:0"
  },
  {
    sr: 19,
    name: "چوہدری اسجد کجر جیندڑ کلاں",
    startTime: "06:00:00",
    pigeons: ["17:17:00", "18:19:00", "", "", "", "", ""],
    total: "23:36:0"
  },
  {
    sr: 20,
    name: "خلیفہ رمیض بھٹی کوٹلہ",
    startTime: "06:00:00",
    pigeons: ["15:25:00", "18:23:00", "", "", "", "", ""],
    total: "21:48:0"
  },
  {
    sr: 21,
    name: "شمریزتارڑ 1",
    startTime: "06:00:00",
    pigeons: ["10:52:00", "11:02:00", "15:35:00", "", "", "", ""],
    total: "19:29:0"
  },
  {
    sr: 22,
    name: "عمر آصف کوٹلہ",
    startTime: "06:00:00",
    pigeons: ["06:06:00", "11:35:00", "17:21:00", "", "", "", ""],
    total: "17:2:0"
  },
  {
    sr: 23,
    name: "استاد جاوید چھت ڈھولہ بھٹی کوٹلہ",
    startTime: "06:00:00",
    pigeons: ["10:13:00", "13:01:00", "", "", "", "", ""],
    total: "11:14:0"
  },
  {
    sr: 24,
    name: "استاد سجاد چھت ملک احسن ملکپور",
    startTime: "06:00:00",
    pigeons: ["", "", "", "", "", "", ""],
    total: "00:00:00"
  },
  {
    sr: 25,
    name: "استاد معشوق اینڈ ملک فیصل ملک پور",
    startTime: "06:00:00",
    pigeons: ["", "", "", "", "", "", ""],
    total: "00:00:00"
  }
];

export const stats = {
  lofts: 30,
  totalPigeons: 210,
  pigeonsLanded: 104,
  pigeonsRemaining: 106,
  lastWinner: "ضیغم شاہ اینڈ وحید بھانبڑه - 20:06:00"
};

export const tournamentDates = ["2025-09-29", "2025-10-01", "2025-10-03", "2025-10-05", "2025-10-07", "Total"];
